benchmark/results/throughput_mc-vs-rust/RAW/flare_mc-plaintext-throughput_mc-run3.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.130ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.113ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.107ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.095ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.098ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.146ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.121ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.104ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.10ms  500.83us   3.84ms   63.56%
    Req/Sec    17.30k     1.06k   21.11k    72.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%    1.47ms
 90.000%    1.79ms
 99.000%    2.26ms
 99.900%    2.69ms
 99.990%    3.09ms
 99.999%    3.44ms
100.000%    3.84ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.031     0.000000            1         1.00
       0.472     0.100000       262116         1.11
       0.623     0.200000       522648         1.25
       0.764     0.300000       782517         1.43
       0.904     0.400000      1043403         1.67
       1.051     0.500000      1304424         2.00
       1.129     0.550000      1435053         2.22
       1.210     0.600000      1565272         2.50
       1.294     0.650000      1696374         2.86
       1.380     0.700000      1825944         3.33
       1.470     0.750000      1956928         4.00
       1.517     0.775000      2022495         4.44
       1.565     0.800000      2086890         5.00
       1.616     0.825000      2152080         5.71
       1.671     0.850000      2217627         6.67
       1.730     0.875000      2283168         8.00
       1.761     0.887500      2315736         8.89
       1.793     0.900000      2347404        10.00
       1.829     0.912500      2380770        11.43
       1.867     0.925000      2413343        13.33
       1.908     0.937500      2445171        16.00
       1.932     0.943750      2462052        17.78
       1.957     0.950000      2477992        20.00
       1.985     0.956250      2494248        22.86
       2.017     0.962500      2510726        26.67
       2.053     0.968750      2527140        32.00
       2.073     0.971875      2535284        35.56
       2.095     0.975000      2543630        40.00
       2.117     0.978125      2551163        45.71
       2.145     0.981250      2559669        53.33
       2.175     0.984375      2567480        64.00
       2.195     0.985938      2571913        71.11
       2.215     0.987500      2575823        80.00
       2.237     0.989062      2579647        91.43
       2.265     0.990625      2583745       106.67
       2.297     0.992188      2587962       128.00
       2.315     0.992969      2589842       142.22
       2.337     0.993750      2591949       160.00
       2.361     0.994531      2593943       182.86
       2.391     0.995313      2596016       213.33
       2.425     0.996094      2597988       256.00
       2.447     0.996484      2599062       284.44
       2.469     0.996875      2600045       320.00
       2.497     0.997266      2601098       365.71
       2.527     0.997656      2602095       426.67
       2.561     0.998047      2603094       512.00
       2.581     0.998242      2603596       568.89
       2.603     0.998437      2604124       640.00
       2.629     0.998633      2604603       731.43
       2.663     0.998828      2605145       853.33
       2.697     0.999023      2605618      1024.00
       2.719     0.999121      2605880      1137.78
       2.743     0.999219      2606137      1280.00
       2.769     0.999316      2606383      1462.86
       2.799     0.999414      2606649      1706.67
       2.829     0.999512      2606895      2048.00
       2.851     0.999561      2607028      2275.56
       2.871     0.999609      2607156      2560.00
       2.891     0.999658      2607275      2925.71
       2.919     0.999707      2607406      3413.33
       2.951     0.999756      2607533      4096.00
       2.969     0.999780      2607596      4551.11
       2.987     0.999805      2607658      5120.00
       3.005     0.999829      2607728      5851.43
       3.031     0.999854      2607786      6826.67
       3.057     0.999878      2607848      8192.00
       3.077     0.999890      2607880      9102.22
       3.091     0.999902      2607914     10240.00
       3.107     0.999915      2607946     11702.86
       3.125     0.999927      2607977     13653.33
       3.153     0.999939      2608006     16384.00
       3.167     0.999945      2608024     18204.44
       3.185     0.999951      2608040     20480.00
       3.197     0.999957      2608054     23405.71
       3.219     0.999963      2608070     27306.67
       3.245     0.999969      2608087     32768.00
       3.261     0.999973      2608094     36408.89
       3.303     0.999976      2608102     40960.00
       3.315     0.999979      2608110     46811.43
       3.335     0.999982      2608118     54613.33
       3.357     0.999985      2608127     65536.00
       3.369     0.999986      2608130     72817.78
       3.423     0.999988      2608134     81920.00
       3.441     0.999989      2608140     93622.86
       3.445     0.999991      2608143    109226.67
       3.479     0.999992      2608146    131072.00
       3.531     0.999993      2608148    145635.56
       3.539     0.999994      2608150    163840.00
       3.555     0.999995      2608152    187245.71
       3.591     0.999995      2608154    218453.33
       3.599     0.999996      2608156    262144.00
       3.603     0.999997      2608157    291271.11
       3.661     0.999997      2608158    327680.00
       3.683     0.999997      2608159    374491.43
       3.685     0.999998      2608160    436906.67
       3.705     0.999998      2608161    524288.00
       3.705     0.999998      2608161    582542.22
       3.719     0.999998      2608162    655360.00
       3.719     0.999999      2608162    748982.86
       3.767     0.999999      2608163    873813.33
       3.767     0.999999      2608163   1048576.00
       3.767     0.999999      2608163   1165084.44
       3.819     0.999999      2608164   1310720.00
       3.819     0.999999      2608164   1497965.71
       3.819     0.999999      2608164   1747626.67
       3.819     1.000000      2608164   2097152.00
       3.819     1.000000      2608164   2330168.89
       3.837     1.000000      2608165   2621440.00
       3.837     1.000000      2608165          inf
#[Mean    =        1.098, StdDeviation   =        0.501]
#[Max     =        3.836, Total count    =      2608165]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3933625 requests in 30.00s, 438.91MB read
Requests/sec: 131119.51
Transfer/sec:     14.63MB