benchmark/results/throughput_mc-vs-rust/RAW/hyper-plaintext-throughput_mc-cal-145336.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  673.43us  14.59ms   73.37%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.69ms
 90.000%    2.14ms
 99.000%    2.85ms
 99.900%    7.97ms
 99.990%   12.45ms
 99.999%   13.59ms
100.000%   14.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.035     0.000000            1         1.00
       0.587     0.100000       144307         1.11
       0.777     0.200000       288451         1.25
       0.934     0.300000       433518         1.43
       1.080     0.400000       576888         1.67
       1.229     0.500000       721189         2.00
       1.307     0.550000       793110         2.22
       1.390     0.600000       865698         2.50
       1.479     0.650000       937697         2.86
       1.577     0.700000      1009486         3.33
       1.689     0.750000      1081964         4.00
       1.750     0.775000      1117688         4.44
       1.816     0.800000      1153886         5.00
       1.886     0.825000      1189832         5.71
       1.961     0.850000      1225779         6.67
       2.044     0.875000      1261672         8.00
       2.091     0.887500      1280434         8.89
       2.139     0.900000      1298225        10.00
       2.191     0.912500      1315754        11.43
       2.251     0.925000      1334214        13.33
       2.317     0.937500      1352223        16.00
       2.351     0.943750      1360861        17.78
       2.391     0.950000      1370172        20.00
       2.433     0.956250      1378887        22.86
       2.483     0.962500      1388076        26.67
       2.539     0.968750      1397076        32.00
       2.569     0.971875      1401453        35.56
       2.603     0.975000      1406031        40.00
       2.641     0.978125      1410395        45.71
       2.683     0.981250      1414848        53.33
       2.733     0.984375      1419455        64.00
       2.759     0.985938      1421589        71.11
       2.791     0.987500      1423915        80.00
       2.825     0.989062      1426169        91.43
       2.863     0.990625      1428348       106.67
       2.909     0.992188      1430687       128.00
       2.933     0.992969      1431728       142.22
       2.963     0.993750      1432878       160.00
       2.997     0.994531      1433995       182.86
       3.035     0.995313      1435110       213.33
       3.083     0.996094      1436272       256.00
       3.111     0.996484      1436832       284.44
       3.141     0.996875      1437388       320.00
       3.187     0.997266      1437932       365.71
       3.321     0.997656      1438489       426.67
       4.447     0.998047      1439048       512.00
       5.199     0.998242      1439328       568.89
       5.943     0.998437      1439611       640.00
       6.607     0.998633      1439891       731.43
       7.347     0.998828      1440174       853.33
       8.067     0.999023      1440454      1024.00
       8.479     0.999121      1440597      1137.78
       8.815     0.999219      1440736      1280.00
       9.215     0.999316      1440880      1462.86
       9.655     0.999414      1441020      1706.67
      10.167     0.999512      1441158      2048.00
      10.415     0.999561      1441229      2275.56
      10.695     0.999609      1441299      2560.00
      10.959     0.999658      1441370      2925.71
      11.239     0.999707      1441442      3413.33
      11.543     0.999756      1441514      4096.00
      11.695     0.999780      1441547      4551.11
      11.847     0.999805      1441582      5120.00
      11.991     0.999829      1441617      5851.43
      12.143     0.999854      1441653      6826.67
      12.287     0.999878      1441687      8192.00
      12.399     0.999890      1441705      9102.22
      12.463     0.999902      1441722     10240.00
      12.583     0.999915      1441740     11702.86
      12.719     0.999927      1441758     13653.33
      12.863     0.999939      1441774     16384.00
      12.927     0.999945      1441783     18204.44
      12.991     0.999951      1441792     20480.00
      13.103     0.999957      1441803     23405.71
      13.159     0.999963      1441811     27306.67
      13.231     0.999969      1441819     32768.00
      13.263     0.999973      1441823     36408.89
      13.343     0.999976      1441827     40960.00
      13.423     0.999979      1441832     46811.43
      13.463     0.999982      1441836     54613.33
      13.543     0.999985      1441841     65536.00
      13.575     0.999986      1441843     72817.78
      13.583     0.999988      1441847     81920.00
      13.583     0.999989      1441847     93622.86
      13.591     0.999991      1441849    109226.67
      13.639     0.999992      1441851    131072.00
      13.687     0.999993      1441853    145635.56
      13.695     0.999994      1441854    163840.00
      13.743     0.999995      1441855    187245.71
      13.759     0.999995      1441856    218453.33
      13.767     0.999996      1441857    262144.00
      13.775     0.999997      1441858    291271.11
      13.775     0.999997      1441858    327680.00
      13.791     0.999997      1441859    374491.43
      13.791     0.999998      1441859    436906.67
      14.351     0.999998      1441861    524288.00
      14.351     0.999998      1441861    582542.22
      14.351     0.999998      1441861    655360.00
      14.351     0.999999      1441861    748982.86
      14.351     0.999999      1441861    873813.33
      14.351     0.999999      1441861   1048576.00
      14.351     0.999999      1441861   1165084.44
      14.351     0.999999      1441861   1310720.00
      14.599     0.999999      1441862   1497965.71
      14.599     1.000000      1441862          inf
#[Mean    =        1.314, StdDeviation   =        0.673]
#[Max     =       14.592, Total count    =      1441862]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1441919 requests in 10.00s, 178.77MB read
Requests/sec: 144190.57
Transfer/sec:     17.88MB